import Accordion from '../../shared/components/ui/Accordion';
import { QuestionCircle } from '../../shared/components/ui/icons';

const HomeFAQ: React.FC = () => {

    const faqs: {
        title: string,
        content: React.ReactNode
    }[] = [
            {
                title: "چگونه با تخفیف‌های همیشگی هتل رزرو کنیم؟",
                content: (<div>
                    <p className='mb-3'>
                        <b> رزرو آنلاین هتل </b>
                        چند سالی است که جایگزین روش‌های سنتی رزرو شده است. در همین
                        راستا سایت سفرانه (آژانس مسافرتی سفرانه مشرق زمین) به عنوان
                        یکی از مهم‌ترین نقش‌آفرینان عرصه خدمات آنلاین گردشگری،
                        واسطه‌ها را حذف کرده و آماده ارائه خدمات رزرواسیون
                        <b> بهترین هتل های تهران </b>و ایران با مناسب‌ترین قیمت و
                        بیشترین تخفیف است.
                    </p>
                    <p className='mb-3'>
                        در سفرانه امکان دسترسی به
                        <b> بهترین هتل های ایران </b>
                        از هتل 5 ستاره الی 1 ستاره؛ از هتل لوکس، هتل آپارتمان، بوتیک
                        هتل تا اقامتگاه سنتی (هتل سنتی) را دارید. علاوه بر این
                        موارد، در این سامانه اطلاعاتی مانند امکانات هتل، موقعیت
                        جغرافیایی روی نقشه، ستاره‌های هتل، تجربه اقامتی، قوانین هتل
                        و امتیاز کاربران به یک هتل خاص را یکجا می‌توانید ملاحظه
                        بفرمایید.
                    </p>
                </div>),
            },
            {
                title: "مزایای رزرو آنلاین هتل از سفرانه چیست؟",
                content: (<div>
                    <ul className='list-inside list-disc '>
                        <li className='mb-2'>
                            رزرو هتل از سفرانه ارزان‌تر از رزرو مستقیم از خود هتل است.
                        </li>
                        <li className='mb-2'>
                            <b> رزرو هتل </b>
                            در سفرانه راحت و سریع است.
                        </li>
                        <li className='mb-2'>
                            <b> فرایند رزرو آنلاین </b>
                            هتل در سفرانه بدون هیچ‌گونه صرف وقت و هزینه‌های جانبی
                            انجام می‌شود.
                        </li>
                        <li className='mb-2'>
                            در سفرانه امکان رزرو
                            <b> هتل های تمام شهرهای ایران </b>
                            را دارید.
                        </li>
                        <li className='mb-2'>
                            در سفرانه امکان جست و جوی هتل براساس موقعیت مکانی روی نقشه
                            و ستاره‌های هتل را دارید.
                        </li>
                        <li className='mb-2'>
                            در قسمت جستجوی هتل می‌توانید هتل را بر اساس کمترین و یا
                            بیشترین قیمت، امتیاز کاربران و بیشترین تخفیف دسته بندی
                            کنید.
                        </li>
                        <li className='mb-2'>
                            در سفرانه موقعیت جغرافیایی هر هتل را بر روی نقشه گوگل با
                            جزئیات و جاهای دیدنی اطراف مشاهده می‌کنید.
                        </li>
                        <li className='mb-2'>
                            تصاویر هتل‌ها به طور اختصاصی توسط سفرانه تهیه شده‌اند که
                            با کیفیت‌ترین تصاویر از موقعیت بیرونی و داخلی هتل در بین
                            تمامی وبسایت‌های
                            <b> رزرو آنلاین هتل </b>
                            هستند.
                        </li>
                        <li className='mb-2'>
                            در صفحه هر هتل، عکس هر واحد اقامتی به طور اختصاصی رو به
                            روی آن نمایش داده می‌شود.
                        </li>
                        <li className='mb-2'>
                            در سفرانه امکان بررسی نظرات و تجربیات مهمانان سابق هتل ها
                            وجود دارد.
                        </li>
                    </ul>
                </div>),
            },
            {
                title: "رزرو هتل با بیشترین تخفیف در سفرانه",
                content: (<div>
                    <p className='mb-3'>
                        تخفیف رزرو آنلاین هتل و سهولت رزرو از اهداف مهم سفرانه و در
                        راستای خدمت رسانی به مشتاقان سفرهای داخلی است. ما در اینجا
                        تمام تلاشمان را می‌کنیم تا هزینه‌های سفر شما را کاهش دهیم و
                        از طرفی موجبات ارتقاء کیفیت خدمات رسانی را فراهم آوریم. در
                        همین راستا برخی از هتلها از جمله
                        <b> هتل آزادی تهران و هتل استقلال تهران </b>
                        (برای شرکت‌ها و سازمان‌ها) با گارانتی سفرانه و تضمین بهترین
                        قیمت قابل رزرو هستند.
                    </p>
                    <p className='mb-3'>
                        برای رزرو هریک از هتل‌ها می‌توانید قیمت ها را مقایسه کنید،
                        تخفیف ها را مشاهده کنید و با کارشناسان رزرواسیون ما در تماس
                        باشید.
                    </p>
                </div>),
            },
            {
                title: "مراحل رزرو هتل در سفرانه به چه صورت است؟",
                content: (<div>
                    <p className='mb-3'>
                        برای
                        <b> رزرو آنلاین هتل </b>
                        در سفرانه از لحظه انتخاب بهترین هتل تا دریافت واچر تنها به
                        اندازه چند کلیک ساده زمان نیاز دارید. کافیست در قسمت جست‌وجو
                        نام شهر مورد نظر و تاریخ ورود و خروجتان را وارد کنید و با
                        زدن دکمه جستجو وارد صفحه رزرو آنلاین هتل‌های همان شهر ‌شوید.
                        در این قسمت قیمت‌ها و تخفیف‌ها را مشاهده کنید و متناسب با
                        بودجه و بازه زمانی مدنظرتان رزرو هتل را انجام بدهید. البته
                        فیلترهای جستجو مانند فیلتر قیمت، ستاره هتل‌، امکانات، امتیاز
                        مهمانان و نوع اقامتگاه شما را برای رسیدن به هتل هدفتان یاری
                        می‌کنند.
                    </p>
                    <p className='mb-3'>
                        بعد از ثبت رزرو، کارشناسان سفرانه با شما تماس می‌گیرند و بعد
                        از کسب رضایت و پرداخت آنلاین هزینه اقامت از سمت شما، رزرو
                        هتل را برای شما نهایی می‌کنند.
                    </p>
                </div>),
            },
            {
                title: "رزرو بهترین هتل داخلی",
                content: (<div>
                    <p className='mb-3'>
                        فراهم کردن
                        <b> رزرو آنلاین بهترین </b>
                        هتل‌های ایران رسالتی است که سفرانه به خوبی آن را در راس
                        اهداف کاری خود قرار داده است. در سفرانه خبری از هتل بی‌کیفیت
                        و خدمات رسانی ضعیف نیست!
                    </p>
                    <p className='mb-3'>
                        پس اگر به دنبال رزرو هتل لوکس،
                        <b>
                            {' '}
                            بهترین هتل های تهران، بهترین هتل‌های مشهد، بهترین هتل‌های
                            اصفهان، بهترین هتل های کیش، بهترین هتل‌های شیراز، بهترین
                            هتل های قشم{' '}
                        </b>
                        و غیره هستید سفرانه همراه بسیار خوبی برای شماست.
                    </p>
                </div>),
            },
            {
                title: "پیگیری رزرو آنلاین هتل در سفرانه",
                content: (<div>
                    <p className='mb-3'>
                        بعد از ثبت
                        <b> رزرو هتل </b>
                        در سایت سفرانه یک کد پیگیری 6 رقمی به شماره موبایل و یا
                        ایمیل شماره ارسال می‌شود. در قسمت پیگیری رزرو در قسمت بالای
                        سایت می‌توانید با وارد کردن شماره موبایل و کدپیگیری وضعیت
                        رزرو آنلاین را مشاهده بفرمایید. ضمن اینکه تمامی مراحل پیشروی
                        ثبت رزرو از طریق پیامک به مسافران اطلاع‌رسانی می‌شود.
                    </p>

                    <p className='mb-3'>
                        همین قسمت را به عنوان رسید (واچر) به هتل ارائه بدهید و اگر
                        نیاز به فاکتور داشتید آن را پرینت گرفته و به اداره و یا
                        سازمان (دولتی/ خصوصی) مد نظرتان تحویل دهید. پشتیبانی رزرو
                        آنلاین هتل در سفرانه از ساعت 9 صبح تا 23 شب آماده پاسخگویی
                        به تمامی سوالات و ابهامات شما در رابطه با فرایند رزرو است.
                    </p>
                </div>),
            }
        ]

    return (
        <div className="max-w-container mx-auto p-5 md:py-10">

            <div className="bg-white p-5 lg:p-7 rounded-lg leading-10 text-justify">
                {faqs.map((faq,index) => <Accordion

                    key={faq.title}

                    title={(<div>
                        <QuestionCircle className='w-5 h-5 mt-.5 rtl:ml-2 ltr:mr-2 fill-current inline-block' />
                        {faq.title}
                    </div>)}

                    content={(
                        <div className='leading-7 text-sm'>
                            {faq.content}
                        </div>
                    )}
                    
                    WrapperClassName={`${index === faqs.length-1 ? "mb-0" : "mb-3 sm:mb-4"}`}

                /> )}
            </div>

        </div>
    )
}

export default HomeFAQ;